# DividedSurfaceCurveChainDoesNotEngageUorV Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceCurveChainDoesNotEngageUorV Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
A chain formed by these curve elements does engage any gridlines on the face to be divided and will be ignored
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceCurveChainDoesNotEngageUorV { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceCurveChainDoesNotEngageUorV As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainDoesNotEngageUorV {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace